MSG_GAME_NOT_FOUND = "Я не смог найти игру с таким названием :("
MSG_GAME_ALREADY_ADDED_TO_DB = "Я уже отслеживаю эту игру!"
MSG_NO_GAMES_TRACKED = "Сейчас я не отслеживаю игры"
MSG_TRACKING_LIST_CLEANED = "Я перестал отслеживать все игры"
MSG_GAME_ADDED_TO_DB = "Начал отслеживать игру \"{0}\""
MSG_GAME_DELETED_FROM_DB = "Перестал отслеживать игру \"{0}\""
MSG_PLACEHOLDER = "Извини, эта команда пока что не реализована"
MSG_GAME_INVALID_NAME = "Пожалуйста, введи корректное название игры"
MSG_GAME_NO_NAME_PASSED = "Хм, мне кажется, что ты забыл написать название игры"
MSG_GAME_RECOMMENDATION_NOT_GENERATED = "Я не могу подобрать похожие игры"
MSG_GAME_AWAITING_USER_INPUT = "Перечисли игры, по которым я должен сделать рекомендацию, через запятую"
MSG_FOUND_N_GAMES = "Нашел {0} игр"
MSG_LIST_TRACKING_GAMES = """
Я отслеживаю следующие игры (всего: {0}):
{1}
"""
MSG_GAME_DESCRIPTION = """
{0}

{2}

Рейтинг: {1} из 10
Количество игроков: {3}
Рекомендуемое количество игроков: {4}

Ссылка: {5}
"""
MSG_START_INFO = """
Привет, я примитивный бот, которого научили искать информацию про настольные игры! Чтобы взаимодействовать со мной, тебе нужно знать следующие команды:

/start — показать это сообщение
/help — показать сообщение со списком доступных команд
/search имя_игры — найти информацию по конкретной игре
/recommend [список_игр] — получить рекомендацию по списку игр 
/add имя_игры — добавить игру в список отслеживаемых
/delete имя_игры — удалить игру из списка отслеживаемых
/list — посмотреть список отслеживаемых игр
/clean — очистить список отслеживаемых игр 
"""
MSG_HELP_LIST_COMMANDS = """
Вот все доступные команды:

/search имя_игры — найти информацию по конкретной игре
/recommend [список_игр] — получить рекомендацию по списку игр
/add имя_игры — добавить игру в список отслеживаемых
/delete имя_игры — удалить игру из списка отслеживаемых
/list — посмотреть список отслеживаемых игр
/clean — очистить список отслеживаемых игр
"""
