MSG_GAME_NOT_FOUND = "Я не смог найти игру с таким названием :("
MSG_GAME_ADDED_TO_DB = "Добавил игру \"{0}\" в свою базу данных"
MSG_GAME_DELETED_FROM_DB = "Удалил игру \'{0}\' из своей базы данных"
MSG_PLACEHOLDER = "Извини, эта команда пока что не реализована"
MSG_GAME_INVALID_NAME = "Пожалуйста, введи корректное название игры"
MSG_GAME_NO_NAME_PASSED = "Хм, мне кажется, что ты забыл написать название игры"
MSG_GAME_DESCRIPTION = """
{0}

{2}

Рейтинг: {1} из 10
Количество игроков: {3}
Рекомендуемое количество игроков: {4}

Ссылка: {5}
"""
MSG_START_INFO = """
Привет, я примитивный бот, которого научили искать информацию про настольные игры! Чтобы взаимодействовать со мной, тебе нужно знать следующие команды:

/start — показать это сообщение
/help — показать сообщение со списком доступных команд
/search имя_игры — найти информацию по конкретной игре
/add имя_игры — добавить игру в список отслеживаемых
/delete имя_игры — удалить игру из списка отслеживаемых
/list — посмотреть список отслеживаемых игр
/clean — очистить список отслеживаемых игр 
"""
MSG_HELP_LIST_COMMANDS = """
Вот все доступные команды:

/start — показать это сообщение
/help — показать сообщение со списком доступных команд
/search имя_игры — найти информацию по конкретной игре
/add имя_игры — добавить игру в список отслеживаемых
/delete имя_игры — удалить игру из списка отслеживаемых
/list — посмотреть список отслеживаемых игр
/clean — очистить список отслеживаемых игр
"""
